{"id":61,"date":"2020-12-31T08:05:38","date_gmt":"2020-12-31T08:05:38","guid":{"rendered":"https:\/\/naz.com.pk\/?page_id=61"},"modified":"2021-04-20T19:25:50","modified_gmt":"2021-04-20T19:25:50","slug":"design-registration","status":"publish","type":"page","link":"https:\/\/naz.com.pk\/design-registration\/","title":{"rendered":"Design Registration Services in Pakistan"},"content":{"rendered":"<p>[vc_row el_class=&#8221;content-set&#8221;][vc_column][vc_column_text]<\/p>\n<h2>What is design?<\/h2>\n<p>A design is the pattern for the construction of an article or system or for the implementation of an activity or procedure, or the result of that plan or specification in the form of a prototype, product or blueprint.<\/p>\n<h2>What is design registration In Pakistan?<\/h2>\n<p>Design registration only protects the visual appearance of the product\/system. It does not protect what the product is made from (such as the material or raw item used) or how it works.<\/p>\n<h2>Who can be the owner of the design?<\/h2>\n<p>The owner of the design can be:<\/p>\n<ul>\n<li>An engineer<\/li>\n<li>An architect<\/li>\n<li>A designer<\/li>\n<\/ul>\n<p>If this individual is employed and the design is created within the scope of their employment terms (such as an employee draftsman preparing the drawing for the architect employer) then the employer owns the rights to the <a href=\"https:\/\/naz.com.pk\/copyright-registration\/\">copyright<\/a> in the design. If the engineer, architect or designer is an independent contractor (absent a written agreement to the contrary) the rights will stay with the engineer, architect or designer, even if the developer paid for the design.<\/p>\n<h2>Which kind of work requires design registration?<\/h2>\n<p>Design registration allows the user to enjoy the ownership for the specified time period. Design can be any pattern, shape, etc that may require registration. Some examples are enlisted below:<\/p>\n<ul>\n<li>Architectural blueprints<\/li>\n<li>Circuit diagrams<\/li>\n<li>Sewing patterns<\/li>\n<li>Business processes<\/li>\n<li>Shapes of products<\/li>\n<li>Pattern on the wallpaper<\/li>\n<\/ul>\n<h2>Usage of design protected work without infringing:<\/h2>\n<p>The originator always wants to protect his\/her work from copying by any other individual. Where you have a product\/process that has a good shape or appearance, and that shape or appearance contributes to a consumer&#8217;s preference or desire for that product, you should consider protecting the shape or appearance by registering a design. In some circumstances, it is possible to use a design that is copyright-protected work without infringing the owner’s right. It is important to note that your content can be removed in response to a claim of infringement, even if you have:<\/p>\n<ul>\n<li>Stated the credit to the originator of the design<\/li>\n<li>Refrained from monetizing the infringing content<\/li>\n<li>Charged for a copy of the content in question<\/li>\n<li>Noticed the similar content that appear elsewhere on the internet<\/li>\n<li>Purchased the content including a hard or soft copy of the work<\/li>\n<li>Copied the content yourself such as logo, brochure design, shape or pattern of any physical product<\/li>\n<li>Mentioned that “no copyright infringement is intended”<\/li>\n<\/ul>\n<h2>Our procedure of design registration in Pakistan:<\/h2>\n<h3>APPLICATION:<\/h3>\n<p>Fill in the endorsed application form. The form 15 is given by the Patent Office including your name, contact details and Structure of Design, patterns, and additionally photos of the design(s) being referred to. You may likewise be required to document, or have the choice of recording, a composed depiction or Statement of Novelty of the respective Design. The Details for the most part should be of the Design and not of the item to which it has been applied. It ought to be precise and satisfactory in separating it from any comparative prior structures. It should cover all the particular stylish highlights of the plan and ought to portray which feature(s) is\/are the most significant. You will likewise be required to pay the documenting expense of Rs. 450\/ – for one structure application.<\/p>\n<p>You may record application yourself or may utilize an IP specialist to help you in documenting the application and finishing the enlistment procedure. In that last case, you will likewise need to record an intensity of lawyer for your operator. The Patent Office enrolls the structure subsequent to undertaking a substantive assessment for checking the current plans for oddity as well as inventiveness. When a structure is enrolled, it is gone into the register of plans and a plan enlistment testament is given.<\/p>\n<h3>EXAMINATION:<\/h3>\n<p>The Patent Office inspects the application to guarantee that it agrees to the regulatory prerequisites (e.g., that all essential formalities have been fulfilled by the applicant). The application number (official receipt) is given in thirty days.<\/p>\n<h3>ASSESSMENT:<\/h3>\n<p>After the formal examination, the substantive assessment of the application is directed generally within a half year of the documenting date. The consequences of the assessment are sent recorded as a hard copy to the applicant or the respective lawyer with the goal that the candidate may react to and to eliminate any complaints raised during assessment.<\/p>\n<h3>ENROLLMENT:<\/h3>\n<p>After all the confirmations and assessments, it is checked whether the complaints have been eradicated by the applicant or not. If no objections are raised in this regard, the plan is enrolled and the enlistment authentication is given.<\/p>\n<h3>Benefits of design registration in Pakistan:<\/h3>\n<p>Once the design is registered, the owner enjoys the following benefits:<\/p>\n<ul>\n<li>The owner enjoys the ownership of exclusive rights to manufacture and sale of the design<\/li>\n<li>The owner obtains the exclusive right to prevent its unauthorized copying or imitation by the rivalries<\/li>\n<li>The commercial value of a <a href=\"https:\/\/naz.com.pk\/company-ntn\/\">company<\/a> and its products are increased<\/li>\n<\/ul>\n<p>At <a href=\"https:\/\/naz.com.pk\/\">Naz Intellectuals<\/a>, you can get all of this done with our expert consultation without any hassles, contact us now and get our design registration services[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row el_class=&#8221;content-set&#8221;][vc_column][vc_column_text] What is design? A design is the pattern for the construction of an article or system or for the implementation of an activity or procedure, or the result of that plan or specification in the form of a prototype, product or blueprint. What is design registration In Pakistan? Design registration only protects the visual appearance of the product\/system. It does not protect what the product is made from (such as the material or raw item used) or how it works. Who can be the owner of the design? The owner of the design can be: An engineer An architect A designer If this individual is employed and the design is created within the scope of their employment terms (such as an employee draftsman preparing the drawing for the architect employer) then the employer owns the rights to the copyright in the design. If the engineer, architect or designer is an independent contractor (absent a written agreement to the contrary) the rights will stay with the engineer, architect or designer, even if the developer paid for the design. Which kind of work requires design registration? Design registration allows the user to enjoy the ownership for the specified time period&#8230;.<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Design Registration | Intellectual Services Pakistan<\/title>\n<meta name=\"description\" content=\"Naz Intellectual Services Offers you Design Registration, trademark, copyright and company NTN registration services in Pakistan. Contact Now For Expert Consultancy\" \/>\n<link rel=\"canonical\" href=\"https:\/\/naz.com.pk\/design-registration\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Design Registration | Intellectual Services Pakistan\" \/>\n<meta property=\"og:description\" content=\"Naz Intellectual Services Offers you Design Registration, trademark, copyright and company NTN registration services in Pakistan. Contact Now For Expert Consultancy\" \/>\n<meta property=\"og:url\" content=\"https:\/\/naz.com.pk\/design-registration\/\" \/>\n<meta property=\"og:site_name\" content=\"NAZ Intellectual Services\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/pages\/category\/Business-Service\/Naz-Intellectual-Services-104558701637439\/\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-20T19:25:50+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"4 minutes\">\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/naz.com.pk\/wp-json\/wp\/v2\/pages\/61"}],"collection":[{"href":"https:\/\/naz.com.pk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/naz.com.pk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/naz.com.pk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/naz.com.pk\/wp-json\/wp\/v2\/comments?post=61"}],"version-history":[{"count":7,"href":"https:\/\/naz.com.pk\/wp-json\/wp\/v2\/pages\/61\/revisions"}],"predecessor-version":[{"id":163,"href":"https:\/\/naz.com.pk\/wp-json\/wp\/v2\/pages\/61\/revisions\/163"}],"wp:attachment":[{"href":"https:\/\/naz.com.pk\/wp-json\/wp\/v2\/media?parent=61"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}